# 6. Необходимо создать (не программно) текстовый файл,
# где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
# Вывести словарь на экран.

# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
with open("homework-5.6.txt", "r", encoding="utf-8") as f:
    f_dict = {}
    for line in f:
        lessons = 0
        line = line.replace(":", "").split()
        for i in line:
            if "(" in i:
                lessons += int(i[:i.index("(")])
        f_dict[line[0]] = lessons
    print(f_dict)
